fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьОшибка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ОтпускаСотрудников/ВКМ_ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ОтпускаСотрудников</name>
  <resources>
    <name>Дней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_ОтпускаСотрудников
	// Стандарт ИТС: если уже есть отказ (например, из проверок), не выполняем проведение
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    
    Попытка
        // Формируем набор записей
        НаборЗаписей = СформироватьДвиженияПоОтпускам(ЭтотОбъект);
        
        // Записываем движения в регистр
        НаборЗаписей.Записать();
        
    Исключение
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не удалось записать движения по отпускам: " + ОписаниеОшибки();
        Сообщение.Поле = "ОтпускаСотрудников";
        Сообщение.Сообщить();
        
        ЗаписьЖурналаРегистрации(
            "Ошибка проведения документа ВКМ_ГрафикОтпусков",
            УровеньЖурналаРегистрации.Ошибка,
            Метаданные.Документы.ВКМ_ГрафикОтпусков,
            Неопределено,
            ОписаниеОшибки()
        );
        
        Отказ = Истина;
    КонецПопытки;
    
КонецПроцедуры

// -----------------------------------------------------------------------------
// Вспомогательная функция: формирует набор записей с агрегацией по сотруднику и году
// Возвращает: НаборЗаписей регистра накопления
// -----------------------------------------------------------------------------
Функция СформироватьДвиженияПоОтпускам(ДокументОбъект)
    
    НаборЗаписей = РегистрыНакопления.ВКМ_ОтпускаСотрудников.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
    
    // Используем Соответствие — ключи могут быть любыми
    СоответствиеАгрегации = Новый Соответствие;
    
    Для Каждого Строка Из ДокументОбъект.ОтпускаСотрудников Цикл
        
        Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
            Продолжить;
        КонецЕсли;
        
        ГодПериода = 0;
        Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда
            ГодПериода = Год(Строка.ДатаНачала);
        Иначе
            Продолжить;
        КонецЕсли;
        
        // Ключ может содержать любые символы — это нормально для Соответствия
        КлючАгрегации = Строка(Строка.Сотрудник.УникальныйИдентификатор()) + "|" + Строка(ГодПериода);
        
        СтароеЗначение = СоответствиеАгрегации.Получить(КлючАгрегации);
        Если СтароеЗначение <> Неопределено Тогда
            ТекущееКоличествоДней = СтароеЗначение + ВычислитьКоличествоДней(Строка.ДатаНачала, Строка.ДатаОкончания);
        Иначе
            ТекущееКоличествоДней = ВычислитьКоличествоДней(Строка.ДатаНачала, Строка.ДатаОкончания);
        КонецЕсли;
        
        СоответствиеАгрегации.Вставить(КлючАгрегации, ТекущееКоличествоДней);
        
    КонецЦикла;
    
    // Формируем записи в регистр
    Для Каждого Элемент Из СоответствиеАгрегации Цикл
        НоваяЗапись = НаборЗаписей.Добавить();
        МассивЧасти = СтрРазделить(Элемент.Ключ, "|");
        СсылкаСотрудника = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивЧасти[0]));
        ГодИзКлюча = Число(МассивЧасти[1]);
        
        НоваяЗапись.Сотрудник = СсылкаСотрудника;
        НоваяЗапись.Год = ГодИзКлюча;
        НоваяЗапись.Дней = Элемент.Значение;
        НоваяЗапись.Период = ДокументОбъект.Дата;
        НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
    КонецЦикла;
    
    Возврат НаборЗаписей;
    
КонецФункции

// -----------------------------------------------------------------------------
// Вспомогательная функция: считает количество календарных дней между датами
// Учитывает, что ДатаОкончания включается в отпуск (обычно так считают дни)
// -----------------------------------------------------------------------------
Функция ВычислитьКоличествоДней(ДатаНачала, ДатаОкончания)
    
    Если ДатаНачала > ДатаОкончания Тогда
        Возврат 0; // Или можно вызвать исключение, если это ошибка бизнес‑логики
    КонецЕсли;
    
    РазницаВСекундах = ДатаОкончания - ДатаНачала;
    КоличествоДней = Цел(РазницаВСекундах / 86400) + 1; // +1, чтобы включить обе даты
    
    Возврат КоличествоДней;
    
КонецФункции
